dj-zhou/one-third-hal-stm32/one-third-hal/core/general-utils.c
        RCC_ClkInitStruct.ClockType = RCC_CLOCKTYPE_HCLK | RCC_CLOCKTYPE_SYSCLK
                                      | RCC_CLOCKTYPE_PCLK1
                                      | RCC_CLOCKTYPE_PCLK2;
        RCC_ClkInitStruct.SYSCLKSource   = RCC_SYSCLKSOURCE_PLLCLK;
        RCC_ClkInitStruct.AHBCLKDivider  = RCC_SYSCLK_DIV1;
        RCC_ClkInitStruct.APB1CLKDivider = RCC_HCLK_DIV2;
        RCC_ClkInitStruct.APB2CLKDivider = RCC_HCLK_DIV1;

        if ( HAL_RCC_ClockConfig( &RCC_ClkInitStruct, FLASH_LATENCY_2 )
             != HAL_OK ) {
            Error_Handler( HSE_VALUE * 5 );
        }
        // DJ: is this needed?
        __HAL_RCC_PLLI2S_ENABLE();
    }
    else {
        // #error not supported.
    }
    return VerifyClocks( 72000000, 36000000, 72000000 );
}
#endif

// ============================================================================
#if defined( STM32F407xx )
static HAL_StatusTypeDef InitClock_F407xx( uint16_t hclk_m, uint16_t pclk1_m,
                                           uint16_t pclk2_m ) {
    if ( ( hclk_m != 168 ) || ( pclk1_m != 42 ) || ( pclk2_m != 84 ) ) {
        Error_Handler( hclk_m * 5000000 );
    }
    RCC_OscInitTypeDef RCC_OscInitStruct = { 0 };
    RCC_ClkInitTypeDef RCC_ClkInitStruct = { 0 };

    __HAL_RCC_PWR_CLK_ENABLE();
    __HAL_PWR_VOLTAGESCALING_CONFIG( PWR_REGULATOR_VOLTAGE_SCALE1 );

    RCC_OscInitStruct.OscillatorType = RCC_OSCILLATORTYPE_HSE;
    RCC_OscInitStruct.HSEState       = RCC_HSE_ON;
    RCC_OscInitStruct.PLL.PLLState   = RCC_PLL_ON;
    RCC_OscInitStruct.PLL.PLLSource  = RCC_PLLSOURCE_HSE;
    RCC_ClkInitStruct.ClockType      = RCC_CLOCKTYPE_HCLK | RCC_CLOCKTYPE_SYSCLK
                                  | RCC_CLOCKTYPE_PCLK1 | RCC_CLOCKTYPE_PCLK2;
    if ( HSE_VALUE == 12000000 ) {
        RCC_OscInitStruct.PLL.PLLM = 8;
        RCC_OscInitStruct.PLL.PLLN = 224;
        RCC_OscInitStruct.PLL.PLLP = RCC_PLLP_DIV2;
        RCC_OscInitStruct.PLL.PLLQ = 4;
    }
    else if ( HSE_VALUE == 8000000 ) {
        RCC_OscInitStruct.PLL.PLLM = 8;
        RCC_OscInitStruct.PLL.PLLN = 336;
        RCC_OscInitStruct.PLL.PLLP = RCC_PLLP_DIV2;
        RCC_OscInitStruct.PLL.PLLQ = 4;
    }
    else {
        // #error not supported.
    }
    RCC_ClkInitStruct.SYSCLKSource   = RCC_SYSCLKSOURCE_PLLCLK;
    RCC_ClkInitStruct.AHBCLKDivider  = RCC_SYSCLK_DIV1;
    RCC_ClkInitStruct.APB1CLKDivider = RCC_HCLK_DIV4;
    RCC_ClkInitStruct.APB2CLKDivider = RCC_HCLK_DIV2;

    if ( HAL_RCC_OscConfig( &RCC_OscInitStruct ) != HAL_OK ) {
        Error_Handler( HSE_VALUE * 5 );
    }
    if ( HAL_RCC_ClockConfig( &RCC_ClkInitStruct, FLASH_LATENCY_5 )
         != HAL_OK ) {
        Error_Handler( HSE_VALUE * 5 );
    }

    return VerifyClocks( 168000000, 42000000, 84000000 );
}
#endif  // STM32F407xx

// ============================================================================
#if defined( STM32F427xx )
static HAL_StatusTypeDef InitClock_F427xx( uint16_t hclk_m, uint16_t pclk1_m,
                                           uint16_t pclk2_m ) {
    if ( ( hclk_m != 180 ) || ( pclk1_m != 45 ) || ( pclk2_m != 90 ) ) {
        Error_Handler( hclk_m * 5000000 );
    }
    RCC_OscInitTypeDef RCC_OscInitStruct = { 0 };
    RCC_ClkInitTypeDef RCC_ClkInitStruct = { 0 };
    __HAL_RCC_PWR_CLK_ENABLE();
    __HAL_PWR_VOLTAGESCALING_CONFIG( PWR_REGULATOR_VOLTAGE_SCALE1 );

    RCC_OscInitStruct.OscillatorType = RCC_OSCILLATORTYPE_HSE;
    RCC_OscInitStruct.HSEState       = RCC_HSE_ON;
    RCC_OscInitStruct.PLL.PLLState   = RCC_PLL_ON;
    RCC_OscInitStruct.PLL.PLLSource  = RCC_PLLSOURCE_HSE;

    if ( HSE_VALUE == 8000000 ) {
        RCC_OscInitStruct.PLL.PLLM = 8;
        RCC_OscInitStruct.PLL.PLLN = 360;
        RCC_OscInitStruct.PLL.PLLP = RCC_PLLP_DIV2;
        RCC_OscInitStruct.PLL.PLLQ = 4;
    }
    else if ( HSE_VALUE == 24000000 ) {
        RCC_OscInitStruct.PLL.PLLM = 24;
        RCC_OscInitStruct.PLL.PLLN = 360;
        RCC_OscInitStruct.PLL.PLLP = RCC_PLLP_DIV2;
        RCC_OscInitStruct.PLL.PLLQ = 4;
    }
    else {
        // #error not supported.
    }
    RCC_ClkInitStruct.ClockType = RCC_CLOCKTYPE_HCLK | RCC_CLOCKTYPE_SYSCLK
                                  | RCC_CLOCKTYPE_PCLK1 | RCC_CLOCKTYPE_PCLK2;
    RCC_ClkInitStruct.SYSCLKSource   = RCC_SYSCLKSOURCE_PLLCLK;
    RCC_ClkInitStruct.AHBCLKDivider  = RCC_SYSCLK_DIV1;
    RCC_ClkInitStruct.APB1CLKDivider = RCC_HCLK_DIV4;
    RCC_ClkInitStruct.APB2CLKDivider = RCC_HCLK_DIV2;

    if ( HAL_RCC_OscConfig( &RCC_OscInitStruct ) != HAL_OK ) {
        Error_Handler( HSE_VALUE * 5 );
    }

    if ( HAL_PWREx_EnableOverDrive() != HAL_OK ) {
        Error_Handler( HSE_VALUE * 5 );
    }

    if ( HAL_RCC_ClockConfig( &RCC_ClkInitStruct, FLASH_LATENCY_5 )
         != HAL_OK ) {
        Error_Handler( HSE_VALUE * 5 );
    }

    return VerifyClocks( 180000000, 45000000, 90000000 );
}
#endif  // STM32F427xx

// ============================================================================
#if defined( STM32F746xx ) || defined( STM32F767xx )
static HAL_StatusTypeDef InitClock_F7xxxx( uint16_t hclk_m, uint16_t pclk1_m,
                                           uint16_t pclk2_m ) {
    if ( ( hclk_m != 216 ) || ( pclk1_m != 54 ) || ( pclk2_m != 108 ) ) {
        Error_Handler( hclk_m * 5000000 );
    }
    if ( HSE_VALUE == 8000000 ) {
        RCC_OscInitTypeDef       RCC_OscInitStruct   = { 0 };
        RCC_ClkInitTypeDef       RCC_ClkInitStruct   = { 0 };
        RCC_PeriphCLKInitTypeDef PeriphClkInitStruct = { 0 };

        __HAL_RCC_PWR_CLK_ENABLE();
        __HAL_PWR_VOLTAGESCALING_CONFIG( PWR_REGULATOR_VOLTAGE_SCALE1 );

        RCC_OscInitStruct.OscillatorType = RCC_OSCILLATORTYPE_HSE;
        RCC_OscInitStruct.HSEState       = RCC_HSE_ON;
        RCC_OscInitStruct.PLL.PLLState   = RCC_PLL_ON;
        RCC_OscInitStruct.PLL.PLLSource  = RCC_PLLSOURCE_HSE;
        RCC_OscInitStruct.PLL.PLLM       = 8;
        RCC_OscInitStruct.PLL.PLLN       = 432;
        RCC_OscInitStruct.PLL.PLLP       = RCC_PLLP_DIV2;
        RCC_OscInitStruct.PLL.PLLQ       = 2;
        if ( HAL_RCC_OscConfig( &RCC_OscInitStruct ) != HAL_OK ) {
            Error_Handler( HSE_VALUE * 5 );
        }

        if ( HAL_PWREx_EnableOverDrive() != HAL_OK ) {
            Error_Handler( HSE_VALUE * 5 );
        }

